Reports/ДвижениеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ДвижениеРаботниковОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетДиаграмма</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетДиаграмма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Работники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Работники</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОбъектовКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовКонтактнойИнформации</Name>
			<Comment>(Упр) Виды объектов контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>Справочник контрагентов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическиеЛица</Name>
					<Comment>Справочник "Физические лица", контактные лица контрагентов, менеджеры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеКонтакты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисныеЦентры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДвижениеРаботниковОрганизаций/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
// Массив доступных видов отчета
Перем мМассивВидыОтчета Экспорт;
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Составляет список возможных вариантов отображения
//
// Параметры: 
//  Отчет - объект отчета.
//
// Возвращаемое значение:
//  спиок значений.
//
Функция ПолучитьСписокВариантовОтображенияОтчета() Экспорт

	СписокВариантовОтображения = Новый СписокЗначений;
	СписокВариантовОтображения.Добавить("СводнаяТаблица",НСтр("ru='Сводная таблица';uk='Зведена таблиця'"));
	СписокВариантовОтображения.Добавить("Диаграмма","Диаграмма");
	СписокВариантовОтображения.Добавить("Таблица","Таблица");
	Возврат СписокВариантовОтображения

КонецФункции // ПолучитьСписокВариантовОтображенияОтчета

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Выполняет настройку отчета по умолчанию для заданного вида отчета
//
// Параметры: 
// 
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	Если ВидОтчета = "" Тогда
		ВидОтчета = НСтр("ru='Движения работников организации';uk='Рухи працівників організації'");
	КонецЕсли;	
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = ВидОтчета;
	ОтчетДиаграмма.ИмяРегистра = "-";
	ОтчетДиаграмма.мНазваниеОтчета = ВидОтчета;
	
	тзПоказатели = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100);
	// Инициализация таблиц всех возможных показателей, группировок,  фильтров
	тзПоказатели.Колонки.Добавить("ИмяПоля", ОписаниеТиповСтрока);
	тзПоказатели.Колонки.Добавить("ПредставлениеПоля", ОписаниеТиповСтрока);
	тзПоказатели.Колонки.Добавить("ФорматнаяСтрока", ОписаниеТиповСтрока);

	ОтчетДиаграмма.Показатели.Загрузить(тзПоказатели);
	ОбщийОтчет.Показатели.Загрузить(тзПоказатели);

	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	Если ВидОтчета = НСтр("ru='Движения работников организации';uk='Рухи працівників організації'") Тогда
	
		// структура представлений полей
		СтруктураПредставлениеПолей = Новый Структура();
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК Событие
		|
		|{ВЫБРАТЬ
		|	// данные о работнике организации
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|			ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизации.Период, ДЕНЬ, -1)
		|		ИНАЧЕ РаботникиОрганизации.Период
		|	КОНЕЦ КАК ДатаСобытия,
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
		|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ РаботникиОрганизации.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Сотрудник.Код
		|			ИНАЧЕ РаботникиОрганизации.Сотрудник.Код
		|		КОНЕЦ КАК ТабельныйНомер,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК Событие
		|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|}
		|
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПредшествующийДвижений.Сотрудник КАК Сотрудник,
		|	        ДатыПредшествующийДвижений.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|			ДатыПредшествующийДвижений.Организация КАК Организация,
		|			РаботникиОрганизаций.Должность КАК Должность,
		|			РаботникиОрганизаций.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			РаботникиОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
		|			РаботникиОрганизаций.Сотрудник.Код КАК ТабельныйНомер
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|				РаботникиОрганизаций.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|				РаботникиОрганизаций.Организация КАК Организация,
		|				МАКСИМУМ(ПредыдущиеДвижения.Период) КАК ДатаПредшествующегоДвижения
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПредыдущиеДвижения
		|					ПО РаботникиОрганизаций.Сотрудник = ПредыдущиеДвижения.Сотрудник
		|						И РаботникиОрганизаций.Организация = ПредыдущиеДвижения.Организация
		|						И РаботникиОрганизаций.Период > ПредыдущиеДвижения.Период
		|			ГДЕ
		|				РаботникиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
		|				И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Увольнение
		|			{ГДЕ
		|				РаботникиОрганизаций.Сотрудник 			КАК Сотрудник,
		|				РаботникиОрганизаций.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|				ВЫБОР
		|					КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = &Увольнение
		|						ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1)
		|					ИНАЧЕ РаботникиОрганизаций.Период
		|				КОНЕЦ КАК ДатаСобытия,
		|				РаботникиОрганизаций.Организация.* КАК ГоловнаяОрганизация}
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиОрганизаций.Сотрудник,
		|				РаботникиОрганизаций.Сотрудник.ФизЛицо,
		|				РаботникиОрганизаций.Организация) КАК ДатыПредшествующийДвижений
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|				ПО РаботникиОрганизаций.Сотрудник = ДатыПредшествующийДвижений.Сотрудник
		|					И РаботникиОрганизаций.Организация = ДатыПредшествующийДвижений.Организация
		|					И РаботникиОрганизаций.Период = ДатыПредшествующийДвижений.ДатаПредшествующегоДвижения) КАК ДанныеУволенныхРаботников
		|		ПО РаботникиОрганизации.Сотрудник = ДанныеУволенныхРаботников.Сотрудник
		|			И РаботникиОрганизации.Организация = ДанныеУволенныхРаботников.Организация}
		|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
		|		//КОНТАКТНАЯ ИНФОРМАЦИЯ: СОЕДИНЕНИЯ
		|		//СОЕДИНЕНИЯ
		|
		|ГДЕ РаботникиОрганизации.Период МЕЖДУ &ДатаНач И &ДатаКон И
		|	РаботникиОрганизации.ПричинаИзмененияСостояния <> &Перемещение
		|
		|{ГДЕ
		|	РаботникиОрганизации.Сотрудник 			КАК Сотрудник,
		|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|			ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизации.Период, ДЕНЬ, -1)
		|		ИНАЧЕ РаботникиОрганизации.Период
		|	КОНЕЦ КАК ДатаСобытия,
		|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
		|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ РаботникиОрганизации.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Сотрудник.Код
		|			ИНАЧЕ РаботникиОрганизации.Сотрудник.Код
		|		КОНЕЦ КАК ТабельныйНомер,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК Событие
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|	//КАТЕГОРИИ
		|}
		|
		|{УПОРЯДОЧИТЬ ПО
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
		|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ РаботникиОрганизации.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Сотрудник.Код
		|			ИНАЧЕ РаботникиОрганизации.Сотрудник.Код
		|		КОНЕЦ КАК ТабельныйНомер,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК Событие
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|}
		|
		|ИТОГИ КОЛИЧЕСТВО(Сотрудник) ПО ОБЩИЕ
		|
		|{ИТОГИ ПО
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизации.Сотрудник.ФизЛицо	КАК ФизЛицо,
		|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец.* КАК Организация,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ РаботникиОрганизации.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	РаботникиОрганизации.Организация.* КАК ГоловнаяОрганизация,
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПричинаИзмененияСостояния КАК Событие
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|}";

		// Преобразуем текст запроса для получения полной информации о физлице
		УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.СтруктураФорматаПолей, "РаботникиОрганизации", "Сотрудник.ФизЛицо");	
		
		// Таблица описания видов объектов контактной информации для возможности вывода в отчет
		ТаблицаВидовОбъектовКИ = Новый ТаблицаЗначений;
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляется контактная информация
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("Представление");// представление поля, для которого добавляется контактная информация
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("ВидОбъекта");   // вид объекта-владельца контактной информации
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("СтрокаТипОбъекта");   // тип объекта-владельца контактной информации
		
		НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
		НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Сотрудник.ФизЛицо";
		НоваяСтрока.Представление = "Работник";
		НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
		НоваяСтрока.СтрокаТипОбъекта = "Справочник.ФизическиеЛица";
		
		НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
		НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Организация";
		НоваяСтрока.Представление = "Организация";
		НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.Организации;
		НоваяСтрока.СтрокаТипОбъекта = "Справочник.Организации";
		
		// Добавим строки запроса, необходимые для выборки контактной информации
		УправлениеОтчетами.ДобавитьВТекстПостроителяКонтактнуюИнформацию(ТаблицаВидовОбъектовКИ, ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.мСоответствиеНазначений, ОбщийОтчет.ПостроительОтчета.Параметры);

		// При использовании свойств и категорий в текст запроса добавляются дополнительные поля
		Если ОбщийОтчет.ИспользоватьСвойстваИКатегории Тогда

			// Свойства и категории, назначаемые пользователем:
			ТаблицаПолей = Новый ТаблицаЗначений;
			ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
			ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
			ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
			ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
			ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

			НоваяСтрока = ТаблицаПолей.Добавить();
			НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Сотрудник.ФизЛицо";
			НоваяСтрока.Представление = "Работник";
			НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;

			// Добавим строки запроса, необходимые для использования свойств и категорий
			ТекстПоляКатегорий = "";
			ТекстПоляСвойств = "";

			УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
					ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
					,, ТекстПоляКатегорий, ТекстПоляСвойств,,,,,,ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);
			
		КонецЕсли;						  
		
		ПостроительОтчета.Текст = ТекстЗапроса;							  
								  
		//представление полей запроса
		СтруктураПредставлениеПолей.Вставить("Сотрудник", "Работник");
		СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавок", НСтр("ru='Занято ставок';uk='Зайнято ставок'"));
		СтруктураПредставлениеПолей.Вставить("ВидЗанятости", НСтр("ru='Вид занятости';uk='Вид зайнятості'"));
		СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", НСтр("ru='Подразделение';uk='Підрозділ'"));
		СтруктураПредставлениеПолей.Вставить("ГоловнаяОрганизация", НСтр("ru='Головная организация';uk='Головна організація'"));
		СтруктураПредставлениеПолей.Вставить("ГрафикРаботы", НСтр("ru='График работы';uk='Графік роботи'"));
		СтруктураПредставлениеПолей.Вставить("ТабельныйНомер", НСтр("ru='Табельный номер';uk='Табельний номер'"));
		СтруктураПредставлениеПолей.Вставить("ДатаСобытия", НСтр("ru='Дата';uk='Дата'"));
		
		УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
		
		// формат полей
		ОбщийОтчет.СтруктураФорматаПолей.Вставить("ДатаСобытия", "ДЛФ=DD");
		
		// группировки по умолчанию
		ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
		ПостроительОтчета.ИзмеренияКолонки.Добавить("Событие");
		ПостроительОтчета.ИзмеренияСтроки.Добавить("ПодразделениеОрганизации");
		
		Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
			УправлениеОтчетами.УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
		КонецЕсли;
		
		// список показателей и форматы их представления
		ОбщийОтчет.ЗаполнитьПоказатели("Сотрудник", "Количество", Истина, "ЧЦ=10; ЧДЦ=0");
		ОтчетДиаграмма.ЗаполнитьПоказатели("Сотрудник", "Количество", Истина, "ЧЦ=10; ЧДЦ=0");
		
		// отборы по умолчанию
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить("Организация");
		МассивОтбора.Добавить("ПодразделениеОрганизации");
		Пока ПостроительОтчета.Отбор.Количество() > 0 Цикл
			ПостроительОтчета.Отбор.Удалить(0);
		КонецЦикла;	
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
		
		// поля по умолчанию
		ПостроительОтчета.ВыбранныеПоля.Очистить();
		ПостроительОтчета.ВыбранныеПоля.Добавить("ДатаСобытия");
		ПостроительОтчета.ВыбранныеПоля.Добавить("ФиоПолное");
		
		// копирование настроек построителя
		ОтчетДиаграмма.ПостроительОтчета.Текст = ТекстЗапроса;
		ОтчетДиаграмма.ПостроительОтчета.УстановитьНастройки(ПостроительОтчета.ПолучитьНастройки());
		
		// настройки отчета
		ОбщийОтчет.РаскрашиватьИзмерения = Истина;
		ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
		ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
		ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
		ОбщийОтчет.мРежимВводаПериода = 0; // произвольный период
		
		ОтчетДиаграмма.мВыбиратьИмяРегистра = Ложь;
		ОтчетДиаграмма.мРежимВводаПериода = 0;
		
	Иначе //возврат;
		// представление полей
		СтруктураПредставлениеПолей = Новый Структура();
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Работники.Физлицо КАК ФизЛицо,
		|   Работники.ПричинаИзмененияСостояния КАК Событие
		|
		|{ВЫБРАТЬ
		|	Работники.Физлицо КАК ФизЛицо,
		|	Работники.Подразделение.* КАК Подразделение,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ Работники.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ Работники.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ Работники.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок,
		|	Работники.ПричинаУвольнения,
		|	ВЫБОР
		|		КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|			ТОГДА ДОБАВИТЬКДАТЕ(Работники.Период, ДЕНЬ, -1)
		|		ИНАЧЕ Работники.Период
		|	КОНЕЦ КАК ДатаСобытия,
		|   Работники.ПричинаИзмененияСостояния КАК Событие
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|}
		|
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПредшествующийДвижений.Физлицо КАК Физлицо,
		|			Работники.Должность КАК Должность,
		|			Работники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			Работники.ГрафикРаботы КАК ГрафикРаботы
		|		ИЗ
		|			(ВЫБРАТЬ
		|				Работники.Физлицо КАК Физлицо,
		|				МАКСИМУМ(ПредыдущиеДвижения.Период) КАК ДатаПредшествующегоДвижения
		|			ИЗ
		|				РегистрСведений.Работники КАК Работники
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК ПредыдущиеДвижения
		|					ПО Работники.Физлицо = ПредыдущиеДвижения.Физлицо
		|						И Работники.Период > ПредыдущиеДвижения.Период
		|			ГДЕ
		|				Работники.Период МЕЖДУ &ДатаНач И &ДатаКон
		|				И Работники.ПричинаИзмененияСостояния = &Увольнение
		|			{ГДЕ
		|				Работники.Физлицо КАК ФизЛицо,
		|				ВЫБОР
		|					КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|						ТОГДА ДОБАВИТЬКДАТЕ(Работники.Период, ДЕНЬ, -1)
		|					ИНАЧЕ Работники.Период
		|				КОНЕЦ КАК ДатаСобытия}
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Работники.Физлицо) КАК ДатыПредшествующийДвижений
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
		|				ПО Работники.Физлицо = ДатыПредшествующийДвижений.Физлицо
		|					И Работники.Период = ДатыПредшествующийДвижений.ДатаПредшествующегоДвижения) КАК ДанныеУволенныхРаботников
		|		ПО Работники.Физлицо = ДанныеУволенныхРаботников.Физлицо}
		|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
		|		//КОНТАКТНАЯ ИНФОРМАЦИЯ: СОЕДИНЕНИЯ
		|		//СОЕДИНЕНИЯ
		|
		|ГДЕ Работники.Период МЕЖДУ &ДатаНач И &ДатаКон И
		|	Работники.ПричинаИзмененияСостояния <> &Перемещение
		|
		|{ГДЕ
		|	Работники.Физлицо КАК ФизЛицо,
		|	Работники.Подразделение.* КАК Подразделение,
		|	ВЫБОР
		|		КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|			ТОГДА ДОБАВИТЬКДАТЕ(Работники.Период, ДЕНЬ, -1)
		|		ИНАЧЕ Работники.Период
		|	КОНЕЦ КАК ДатаСобытия,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ Работники.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ Работники.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ Работники.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|	//КАТЕГОРИИ
		|}
		|
		|{УПОРЯДОЧИТЬ ПО
		|	Работники.Физлицо КАК ФизЛицо,
		|	Работники.Подразделение.* КАК Подразделение,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ Работники.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ Работники.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ Работники.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|}
		|
		|ИТОГИ КОЛИЧЕСТВО(Физлицо) ПО
		|	ОБЩИЕ
		|
		|{ИТОГИ ПО
		|	Работники.Подразделение.* КАК Подразделение,
		|	Работники.ПричинаИзмененияСостояния КАК Событие,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.Должность
		|			ИНАЧЕ Работники.Должность
		|		КОНЕЦ КАК Должность,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ГрафикРаботы
		|			ИНАЧЕ Работники.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|			КОГДА Работники.ПричинаИзмененияСостояния = &Увольнение
		|				ТОГДА ДанныеУволенныхРаботников.ЗанимаемыхСтавок
		|			ИНАЧЕ Работники.ЗанимаемыхСтавок
		|		КОНЕЦ КАК ЗанимаемыхСтавок
		| 	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
		|	//КОНТАКТНАЯ ИНФОРМАЦИЯ: ПОЛЯ 
		|	//СВОЙСТВА
		|}
		|";

		// Преобразуем текст запроса для получения полной информации о физлице
		УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.СтруктураФорматаПолей, "Работники");	
		
		// Таблица описания видов объектов контактной информации для возможности вывода в отчет
		ТаблицаВидовОбъектовКИ = Новый ТаблицаЗначений;
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляется контактная информация
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("Представление");// представление поля, для которого добавляется контактная информация
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("ВидОбъекта");   // вид объекта-владельца контактной информации
		ТаблицаВидовОбъектовКИ.Колонки.Добавить("СтрокаТипОбъекта");   // тип объекта-владельца контактной информации
		
		НоваяСтрока = ТаблицаВидовОбъектовКИ.Добавить();
		НоваяСтрока.ПутьКДанным = "Работники.ФизЛицо";
		НоваяСтрока.Представление = "Работник";
		НоваяСтрока.ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
		НоваяСтрока.СтрокаТипОбъекта = "Справочник.ФизическиеЛица";
		
		// Добавим строки запроса, необходимые для выборки контактной информации
		УправлениеОтчетами.ДобавитьВТекстПостроителяКонтактнуюИнформацию(ТаблицаВидовОбъектовКИ, ТекстЗапроса, СтруктураПредставлениеПолей, ОбщийОтчет.мСоответствиеНазначений, ОбщийОтчет.ПостроительОтчета.Параметры);
		
		// При использовании свойств и категорий в текст запроса добавляются дополнительные поля
		Если ОбщийОтчет.ИспользоватьСвойстваИКатегории Тогда

			// Свойства и категории, назначаемые пользователем:

			ТаблицаПолей = Новый ТаблицаЗначений;
			ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
			ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
			ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
			ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
			ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

			НоваяСтрока = ТаблицаПолей.Добавить();
			НоваяСтрока.ПутьКДанным = "Работники.ФизЛицо";
			НоваяСтрока.Представление = "Работник";
			НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;

			// Добавим строки запроса, необходимые для использования свойств и категорий
			ТекстПоляКатегорий = "";
			ТекстПоляСвойств = "";

			УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, 
					ОбщийОтчет.мСоответствиеНазначений, ПостроительОтчета.Параметры
					,, ТекстПоляКатегорий, ТекстПоляСвойств,,,,,,ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);

		КонецЕсли;								  
		
		ПостроительОтчета.Текст = ТекстЗапроса;							  
		
		// представление полей
		СтруктураПредставлениеПолей.Вставить("ФизЛицо", "Работник");
		СтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
		СтруктураПредставлениеПолей.Вставить("ГрафикРаботы", "График работы");
		СтруктураПредставлениеПолей.Вставить("ПричинаУвольнения", "Причина увольнения");
		СтруктураПредставлениеПолей.Вставить("ДатаСобытия", "Дата");
		
		УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
		
		// формат полей
		ОбщийОтчет.СтруктураФорматаПолей.Вставить("ДатаСобытия", "ДЛФ=DD");
		
		// группировки по умолчанию
		ПостроительОтчета.ИзмеренияКолонки.Добавить("Событие");
		ПостроительОтчета.ИзмеренияСтроки.Добавить("Подразделение");
		
		Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
			УправлениеОтчетами.УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
		КонецЕсли;
		
		// список показателей и форматы их представления
		ОбщийОтчет.ЗаполнитьПоказатели("ФизЛицо", "Количество", Истина, "ЧЦ=10; ЧДЦ=0");
		ОтчетДиаграмма.ЗаполнитьПоказатели("ФизЛицо", "Количество", Истина, "ЧЦ=10; ЧДЦ=0");
		
		// отборы по умолчанию
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить("Подразделение");
		МассивОтбора.Добавить("Должность");
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
		
		// поля по умолчанию
		ПостроительОтчета.ВыбранныеПоля.Очистить();
		ПостроительОтчета.ВыбранныеПоля.Добавить("ДатаСобытия");
		ПостроительОтчета.ВыбранныеПоля.Добавить("ФиоПолное");
		
		// копирование настроек построителя
		ОтчетДиаграмма.ПостроительОтчета.Текст = ТекстЗапроса;
		ОтчетДиаграмма.ПостроительОтчета.УстановитьНастройки(ПостроительОтчета.ПолучитьНастройки());
		
		// настройки отчета
		ОбщийОтчет.РаскрашиватьИзмерения = Истина;
		ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
		ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
		ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
		ОбщийОтчет.мРежимВводаПериода = 0; // произвольный период
		
		ОтчетДиаграмма.мВыбиратьИмяРегистра = Ложь;
		ОтчетДиаграмма.мРежимВводаПериода = 0;
		
	КонецЕсли;	
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Перемещение", Перечисления.ПричиныИзмененияСостояния.Перемещение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОбщийОтчет.ДатаКон);
	Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда 
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(РабочаяДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(РабочаяДата));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(РабочаяДата));
	Иначе 
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ОбщийОтчет.ДатаКон));
	КонецЕсли;
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

// Выполняет запрос и формирует диаграмму-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьДиаграмму(Диаграмма) Экспорт

	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("Перемещение",	Перечисления.ПричиныИзмененияСостояния.Перемещение);
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("Увольнение",	Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОтчетДиаграмма.ДатаКон);
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ОтчетДиаграмма.ДатаКон));
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ОтчетДиаграмма.ДатаКон));
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ОтчетДиаграмма.ДатаКон));
	ОтчетДиаграмма.СформироватьОтчет(Диаграмма);

КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьСводнуюТаблицу(ДокументРезультат) Экспорт

	ПостроительОтчета = ПолучитьПостроительОтчета();
	
	ПостроительОтчета.Параметры.Вставить("Перемещение",	Перечисления.ПричиныИзмененияСостояния.Перемещение);
	ПостроительОтчета.Параметры.Вставить("Увольнение",	Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ОбщийОтчет.ДатаКон);
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ОбщийОтчет.ДатаКон));
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ОбщийОтчет.ДатаКон));
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ОбщийОтчет.ДатаКон));

	ПостроительОтчета.Параметры.Вставить("ДатаНач", ОбщийОтчет.ДатаНач);
	Если ОбщийОтчет.ДатаКон <> '00010101000000' Тогда
		Если ОбщийОтчет.мРежимВводаПериода = 1 Тогда
			ПостроительОтчета.Параметры.Вставить("ДатаКон", НачалоДня(ОбщийОтчет.ДатаКон + 60*60*24));
		Иначе
			ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ОбщийОтчет.ДатаКон ));
		КонецЕсли;
	Иначе
		ПостроительОтчета.Параметры.Вставить("ДатаКон", '00010101000000');
	КонецЕсли;
	
	ПостроительОтчета.Выполнить();
	ДокументРезультат.ИсточникДанных = ПостроительОтчета.Результат;
	ОбновлятьОформлениеСводнойТаблицы = ДокументРезультат.Данные.Количество() = 0 и ДокументРезультат.Строки.Количество() = 0;
	Если ОбновлятьОформлениеСводнойТаблицы Тогда
		Для ИндексПоля = 0 По ДокументРезультат.Поля.Количество() - 1 Цикл
			ПолеТаблицы = ДокументРезультат.Поля[ИндексПоля];
			Если ПолеТаблицы.Ресурс Тогда
				ДокументРезультат.Данные.Добавить(ПолеТаблицы)
			Иначе
				ДокументРезультат.Строки.Добавить(ПолеТаблицы)
			КонецЕсли;
		КонецЦикла;
		ДокументРезультат.Колонки.Добавить(ДокументРезультат.Данные);
	КонецЕсли;
	
КонецПроцедуры


// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	СтруктураНастроек.Вставить("ВариантОтображения", ВариантОтображения);
	СтруктураНастроек.Вставить("ВидОтчета", ВидОтчета);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет = Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		
		СохраненныеНастройки.Свойство("ВариантОтображения", ВариантОтображения);
		СохраненныеНастройки.Свойство("ВидОтчета", ВидОтчета);
		
	КонецЕсли;
	
КонецПроцедуры

мМассивВидыОтчета = Новый Массив;
мМассивВидыОтчета.Добавить("Движения работников организации");
мМассивВидыОтчета.Добавить("Движения работников предприятия");

#КонецЕсли
